package com.yztc.kaisa.domain.team;

import java.util.List;

public class Pssenger {


    /**
     * resultmsg : {"code":"0","msg":"成功"}
     * data : {"uuid":"4CDCC10C4E1246ABB56EEA8BEB2E600F","status":"0","total":"14","total_found":"14","pn":"1","rn":"15","error":"","matches":[{"cruise_code":"MR20170624-13","cruise_id":"100440","line_id":"100409","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+巴黎13日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/adede8b3b1ca4339abbbdfb06207848e.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在拥有全欧洲最具魅力的黄金海岸，漫步鲜花装点的街头让人恍如在童话中的尼斯；\r\n两大著名时尚之都- 米兰、巴黎尽情享受购物的乐趣。\r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！\r\n搭乘法国时速高达300公里的TGV高速火车，节省您南北拉车的劳顿，并体验欧洲高科技运输工具舒适快感；","trip_date":"2017-06-24","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170722-7N8","cruise_id":"100442","line_id":"100418","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"","feature":"","trip_date":"2017-07-19","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170805-7N8","cruise_id":"100443","line_id":"100419","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/ff03fa1cde004a4a86fc20c6175e1bf8.png","feature":"特别安排： \r\n1.\t精心的酒店安排-当地四星酒店，让您一洗疲劳；\r\n2.\t在迈阿密大沼泽国家公园，体验野生美洲鳄鱼近在咫尺的刺激；\r\n3.\t前往佛罗里达州西锁岛KeyWest-也是美国领土最南端，探寻美国的天涯海角；\r\n4.\t特别安排到北美规模最大的奥特莱斯购物，畅快购物；\r\n5.\t贴心的欢迎仪式\u2014在海洋和悦号游轮上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n6.\t多元文化的餐饮-游轮上每天都会有5顿免费餐饮提供，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有；\r\n7.\t五星级的度假体验-游轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品尝美酒，在游泳池放松；游轮上的娱乐活动精彩纷呈，令人难以置信，随时随地的惊喜，不断满足您的多彩心情。\r\n特别感受： \r\n1.    搭乘世界上最大最新的游轮，22.7万吨的海洋和悦号-精彩难以想象！\r\n2.    数不尽的新鲜-皇家大道、海上剧院、模拟冲浪，位于船尾的极限水滑道可以让您从15层甲板一路滑到6层甲板的百达汇大道上，横跨9层高度，成为游轮界里高度最高的水滑道！就等您来！\r\n3.    前往皇家加勒比私享海岛-海地最美岛屿拉巴第，您将可以尽享私密海域所带来的阳光假期；\r\n4.    前往波多黎各首府圣胡安，穿梭在新旧城区，看带有西班牙殖民时期的遗迹的建筑和摩天大楼的碰撞；\r\n5.    前往荷属圣马丁的菲利普斯堡-最吸引人的是数英里长商业街区中的免税商店和打折免税商店，还可以欣赏城市的艺术画廊，古老的堡垒，赌场和动物园，以及大湾泳滩及其海边步道。\r\n","trip_date":"2017-08-02","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170805-7N8","cruise_id":"100444","line_id":"100419","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/ff03fa1cde004a4a86fc20c6175e1bf8.png","feature":"特别安排： \r\n1.\t精心的酒店安排-当地四星酒店，让您一洗疲劳；\r\n2.\t在迈阿密大沼泽国家公园，体验野生美洲鳄鱼近在咫尺的刺激；\r\n3.\t前往佛罗里达州西锁岛KeyWest-也是美国领土最南端，探寻美国的天涯海角；\r\n4.\t特别安排到北美规模最大的奥特莱斯购物，畅快购物；\r\n5.\t贴心的欢迎仪式\u2014在海洋和悦号游轮上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n6.\t多元文化的餐饮-游轮上每天都会有5顿免费餐饮提供，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有；\r\n7.\t五星级的度假体验-游轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品尝美酒，在游泳池放松；游轮上的娱乐活动精彩纷呈，令人难以置信，随时随地的惊喜，不断满足您的多彩心情。\r\n特别感受： \r\n1.    搭乘世界上最大最新的游轮，22.7万吨的海洋和悦号-精彩难以想象！\r\n2.    数不尽的新鲜-皇家大道、海上剧院、模拟冲浪，位于船尾的极限水滑道可以让您从15层甲板一路滑到6层甲板的百达汇大道上，横跨9层高度，成为游轮界里高度最高的水滑道！就等您来！\r\n3.    前往皇家加勒比私享海岛-海地最美岛屿拉巴第，您将可以尽享私密海域所带来的阳光假期；\r\n4.    前往波多黎各首府圣胡安，穿梭在新旧城区，看带有西班牙殖民时期的遗迹的建筑和摩天大楼的碰撞；\r\n5.    前往荷属圣马丁的菲利普斯堡-最吸引人的是数英里长商业街区中的免税商店和打折免税商店，还可以欣赏城市的艺术画廊，古老的堡垒，赌场和动物园，以及大湾泳滩及其海边步道。\r\n","trip_date":"2017-08-05","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170805-13","cruise_id":"100445","line_id":"100409","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+巴黎13日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/adede8b3b1ca4339abbbdfb06207848e.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在拥有全欧洲最具魅力的黄金海岸，漫步鲜花装点的街头让人恍如在童话中的尼斯；\r\n两大著名时尚之都- 米兰、巴黎尽情享受购物的乐趣。\r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！\r\n搭乘法国时速高达300公里的TGV高速火车，节省您南北拉车的劳顿，并体验欧洲高科技运输工具舒适快感；","trip_date":"2017-08-05","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170708-12","cruise_id":"100446","line_id":"100420","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士12日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/49607e9c59984652907cdd2dfac52018.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-07-08","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170722-12","cruise_id":"100448","line_id":"100421","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士 12日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/c5f8fa5436fd4205888177deceedcfab.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-07-22","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170819-12","cruise_id":"100449","line_id":"100422","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士12日 之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/39212a87972546c6b767575050e7a98b.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-08-19","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170930-7N8","cruise_id":"100450","line_id":"100424","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d西加勒比海13日阳光之旅","image_url":"","feature":"","trip_date":"2017-09-27","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MU20170624-11","cruise_id":"100454","line_id":"100426","product_type":"1002","line_name":"MSC地中海邮轮\u201c音乐号\u201d爱琴海11日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/818e57ada74e4e28a8d9a68bc23b02e5.jpg","feature":"特别安排： \r\n精心的酒店安排 \u2014\u2014 全程安排当地四星级酒店，安逸的舒适环境，感受夜的美； \r\n贴心的欢迎仪式 \u2014\u2014 在MSC音乐号上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n多元文化的餐饮 \u2014\u2014 邮轮上每天都会由意大利的大厨安排五顿餐饮，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有。岸上观光行程安排当地特色餐和中餐，让客人体会全世界的美食； \r\n五星级的度假体验\u2014\u2014 邮轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品位美酒，在游泳池放松；船上意大利风格的设计无处不在－美丽与优雅，创新与古典； \r\n\r\n线路特色：\r\n1.乘坐意大利风情豪华邮轮，享受纯正意大利式服务，不必再天天收拾行囊，不出房间就可尽览海上美景，享受美好的休闲假期；\r\n2.前往\u201c浪漫水城\u201d威尼斯，这座迷人的水上城市犹如一位温婉的公主，清波流动，水巷蜿蜒，诗情画意，挥之不去；\r\n3.圣托里尼岛的爱琴海逍遥游，沉醉伊亚小镇浪漫夕阳；\r\n4.安排雅典卫城游览，卫城是雅典以及全希腊的一颗明珠，从这里可以俯瞰整个雅典城，更好的了解这个古城；\r\n5.亚得里亚海沿岸保存中世纪古城原貌最完整的城市之一，并被列入联合国教科文组织世界遗产名录-科托尔；\r\n6.前往莎翁笔下罗密欧与朱丽叶的殉情地\u2014维罗那，这里是年轻人心目中的爱情胜地。","trip_date":"2017-06-24","all_trip_date":"","travel_days":"11","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1019.0","name":"音乐号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MU20170812-11","cruise_id":"100455","line_id":"100426","product_type":"1002","line_name":"MSC地中海邮轮\u201c音乐号\u201d爱琴海11日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/818e57ada74e4e28a8d9a68bc23b02e5.jpg","feature":"特别安排： \r\n精心的酒店安排 \u2014\u2014 全程安排当地四星级酒店，安逸的舒适环境，感受夜的美； \r\n贴心的欢迎仪式 \u2014\u2014 在MSC音乐号上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n多元文化的餐饮 \u2014\u2014 邮轮上每天都会由意大利的大厨安排五顿餐饮，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有。岸上观光行程安排当地特色餐和中餐，让客人体会全世界的美食； \r\n五星级的度假体验\u2014\u2014 邮轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品位美酒，在游泳池放松；船上意大利风格的设计无处不在－美丽与优雅，创新与古典； \r\n\r\n线路特色：\r\n1.乘坐意大利风情豪华邮轮，享受纯正意大利式服务，不必再天天收拾行囊，不出房间就可尽览海上美景，享受美好的休闲假期；\r\n2.前往\u201c浪漫水城\u201d威尼斯，这座迷人的水上城市犹如一位温婉的公主，清波流动，水巷蜿蜒，诗情画意，挥之不去；\r\n3.圣托里尼岛的爱琴海逍遥游，沉醉伊亚小镇浪漫夕阳；\r\n4.安排雅典卫城游览，卫城是雅典以及全希腊的一颗明珠，从这里可以俯瞰整个雅典城，更好的了解这个古城；\r\n5.亚得里亚海沿岸保存中世纪古城原貌最完整的城市之一，并被列入联合国教科文组织世界遗产名录-科托尔；\r\n6.前往莎翁笔下罗密欧与朱丽叶的殉情地\u2014维罗那，这里是年轻人心目中的爱情胜地。","trip_date":"2017-08-12","all_trip_date":"","travel_days":"11","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1019.0","name":"音乐号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP0623-12","cruise_id":"100456","line_id":"100427","product_type":"1002","line_name":"公主邮轮\u201c帝王公主号\u201d北欧14日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/db6ba67fd77e41adba390b853fcf4671.jpeg","feature":"特别感受：\r\n1.无法抵挡的美食享受\u2014公主邮轮使用最新鲜的食材，世界各国大厨为您带来无与伦比的美味大餐，这里有全球的美食适合任何口味，从无尽的自助选择到美味比萨，都能让您在每一份餐食中体味到新鲜与关怀；\r\n2.休闲天堂\u2014帝王公主号可谓是休闲的天堂。您可以在淡水泳池里自在畅游、在温水按摩池内惬意舒展、在莲花水疗放松身心，或者在专为成人设立的圣殿成人休憩区享受不被打扰的宁静；\r\n3.精彩炫目的娱乐活动\u2014帝王公主号会让您尽情享受眼花缭乱的魔术表演，电影，顶级的喜剧演员和夜总会。每一个角落都有不可思议的事情发生,值得您日夜去探索和体验各种精彩；\r\n4.惊险刺激的海景步道\u2014\u2014吸引眼球的当属位于顶层的海景悬臂酒吧\u2014\u2014海上漫步！一段封闭的玻璃地板走道超出船舷外8米，可以在这里俯瞰脚下40米的海面，感受漫步海上的惊险刺激。\r\n\r\n行程特色：\r\n1.童话之城\u2014丹麦首都哥本哈根，斯堪的纳维亚国家中最大，最具活力的城市，也是旅游和娱乐的天堂，在哥本哈根与小美人鱼雕像轻声交谈；\r\n2.前往\u201c北方的威尼斯\u201d\u2014斯德哥尔摩，这座由14个岛屿组成的城市历史悠久、文化繁荣，令人诧异的美比比皆是，充分感受十四岛之城的独特魅力；\r\n3.在俄罗斯最具欧洲风格的城市\u2014\u2014圣彼得堡是俄罗斯第二大城市，坐落在波罗的海芬兰湾旁，规模仅次于莫斯科，圣彼得堡更具皇家风范，被联合国教科文组织列为第八位受欢迎的旅游城市； \r\n4.诺贝尔和平奖的颁奖地\u2014奥斯陆，奥斯陆是挪威的首都和最大的城市，三面被群山丛林和原野所环抱，因而既有海滨城市的旖旎风光，又有依托高山密林而具有的雄浑气势；\r\n5.在被誉为\u201c波罗的海的钻石\u201d之称的爱沙尼亚首都\u2014\u2014塔林，游览被联合国教科文组织公布为世界文化遗产之一、保留了绝大部份中世纪建筑的老城；\r\n6.\u201c北方洁白城市\u201d\u2014毗邻波罗的海，是一座古典美与现代文明融为一体的都市，又是一座都市建筑与自然风光巧妙结合在一起的花园城。\r\n7.北欧四国各大经典城市无一错过，充分利用14天时间游历各国，饱览各国风情。\r\n\r\n特别推荐：\r\n1.公主邮轮公司打造的\u201c帝王公主号\u201d2014年全新下水，是最新下水的\u201c盛世公主号\u201d和2013年下水的皇家公主号的姐妹船的姊妹船，全新的特色及创新的改革，让想象力更加璀璨；\r\n2.圣彼得堡过夜2日停留，让您充分欣赏这座叹为观止、魅力十足的国际大都市。\r\n","trip_date":"2017-06-23","all_trip_date":"","travel_days":"14","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1034.0","name":"帝王公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP0806-14","cruise_id":"100457","line_id":"100427","product_type":"1002","line_name":"公主邮轮\u201c帝王公主号\u201d北欧14日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/db6ba67fd77e41adba390b853fcf4671.jpeg","feature":"特别感受：\r\n1.无法抵挡的美食享受\u2014公主邮轮使用最新鲜的食材，世界各国大厨为您带来无与伦比的美味大餐，这里有全球的美食适合任何口味，从无尽的自助选择到美味比萨，都能让您在每一份餐食中体味到新鲜与关怀；\r\n2.休闲天堂\u2014帝王公主号可谓是休闲的天堂。您可以在淡水泳池里自在畅游、在温水按摩池内惬意舒展、在莲花水疗放松身心，或者在专为成人设立的圣殿成人休憩区享受不被打扰的宁静；\r\n3.精彩炫目的娱乐活动\u2014帝王公主号会让您尽情享受眼花缭乱的魔术表演，电影，顶级的喜剧演员和夜总会。每一个角落都有不可思议的事情发生,值得您日夜去探索和体验各种精彩；\r\n4.惊险刺激的海景步道\u2014\u2014吸引眼球的当属位于顶层的海景悬臂酒吧\u2014\u2014海上漫步！一段封闭的玻璃地板走道超出船舷外8米，可以在这里俯瞰脚下40米的海面，感受漫步海上的惊险刺激。\r\n\r\n行程特色：\r\n1.童话之城\u2014丹麦首都哥本哈根，斯堪的纳维亚国家中最大，最具活力的城市，也是旅游和娱乐的天堂，在哥本哈根与小美人鱼雕像轻声交谈；\r\n2.前往\u201c北方的威尼斯\u201d\u2014斯德哥尔摩，这座由14个岛屿组成的城市历史悠久、文化繁荣，令人诧异的美比比皆是，充分感受十四岛之城的独特魅力；\r\n3.在俄罗斯最具欧洲风格的城市\u2014\u2014圣彼得堡是俄罗斯第二大城市，坐落在波罗的海芬兰湾旁，规模仅次于莫斯科，圣彼得堡更具皇家风范，被联合国教科文组织列为第八位受欢迎的旅游城市； \r\n4.诺贝尔和平奖的颁奖地\u2014奥斯陆，奥斯陆是挪威的首都和最大的城市，三面被群山丛林和原野所环抱，因而既有海滨城市的旖旎风光，又有依托高山密林而具有的雄浑气势；\r\n5.在被誉为\u201c波罗的海的钻石\u201d之称的爱沙尼亚首都\u2014\u2014塔林，游览被联合国教科文组织公布为世界文化遗产之一、保留了绝大部份中世纪建筑的老城；\r\n6.\u201c北方洁白城市\u201d\u2014毗邻波罗的海，是一座古典美与现代文明融为一体的都市，又是一座都市建筑与自然风光巧妙结合在一起的花园城。\r\n7.北欧四国各大经典城市无一错过，充分利用14天时间游历各国，饱览各国风情。\r\n\r\n特别推荐：\r\n1.公主邮轮公司打造的\u201c帝王公主号\u201d2014年全新下水，是最新下水的\u201c盛世公主号\u201d和2013年下水的皇家公主号的姐妹船的姊妹船，全新的特色及创新的改革，让想象力更加璀璨；\r\n2.圣彼得堡过夜2日停留，让您充分欣赏这座叹为观止、魅力十足的国际大都市。\r\n","trip_date":"2017-08-06","all_trip_date":"","travel_days":"14","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1034.0","name":"帝王公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP20170624-7N8","cruise_id":"100458","line_id":"100428","product_type":"1002","line_name":"冰河世纪\u2014公主邮轮\u201c红宝石公主号\u201d 美国阿拉斯加12日之旅","image_url":"","feature":"","trip_date":"2017-06-22","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1041.0","name":"红宝石公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"}],"statistics_info":{"trip_date":[],"company":[{"num":"3.0","name":"1006","attr":"公主邮轮","ship":[{"num":"1.0","name":"1041","attr":"红宝石公主号"},{"num":"2.0","name":"1034","attr":"帝王公主号"}]},{"num":"4.0","name":"1001","attr":"皇家加勒比邮轮","ship":[{"num":"4.0","name":"1030","attr":"海洋和悦号"}]},{"num":"7.0","name":"1009","attr":"地中海邮轮","ship":[{"num":"5.0","name":"1051","attr":"传奇号"},{"num":"2.0","name":"1019","attr":"音乐号"}]}],"departure":[{"num":"14.0","name":"10033","attr":"北京"}],"travel_days":[{"num":"2.0","name":"11.0","attr":null},{"num":"4.0","name":"12.0","attr":null},{"num":"6.0","name":"13.0","attr":null},{"num":"2.0","name":"14.0","attr":null}],"district_catalog":[{"num":"1.0","name":"1097","attr":"亚洲航线","district_item":[]},{"num":"13.0","name":"1098","attr":"欧美航线","district_item":[{"num":"1.0","name":"1025","attr":"阿拉斯加"},{"num":"5.0","name":"1027","attr":"地中海"},{"num":"4.0","name":"1022","attr":"欧洲"},{"num":"3.0","name":"1028","attr":"加勒比海"}]}],"continent":[{"num":"9.0","name":"10000","attr":"亚洲","country":[{"num":"9.0","name":"10006","attr":"中国"}]},{"num":"41.0","name":"10001","attr":"欧洲","country":[{"num":"2.0","name":"10125","attr":"德国"},{"num":"2.0","name":"10514","attr":"黑山共和国"},{"num":"2.0","name":"10106","attr":"挪威"},{"num":"2.0","name":"10108","attr":"瑞典"},{"num":"3.0","name":"10152","attr":"瑞士"},{"num":"7.0","name":"10133","attr":"意大利"},{"num":"2.0","name":"10128","attr":"爱沙尼亚"},{"num":"2.0","name":"10115","attr":"俄罗斯"},{"num":"5.0","name":"10101","attr":"法国"},{"num":"2.0","name":"10100","attr":"希腊"},{"num":"5.0","name":"10135","attr":"西班牙"},{"num":"2.0","name":"10113","attr":"芬兰"},{"num":"5.0","name":"10129","attr":"马耳他"}]}]},"searchanalysis_tips":{"sa_paras":{"range":"","correcting_word":"","keyword":"","correct_word":"","landmark":"","core_word":""}},"recommend_type":"0","recommends":[]}
     */

    private ResultmsgBean resultmsg;
    private DataBean data;

    public ResultmsgBean getResultmsg() {
        return resultmsg;
    }

    public void setResultmsg(ResultmsgBean resultmsg) {
        this.resultmsg = resultmsg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class ResultmsgBean {
        /**
         * code : 0
         * msg : 成功
         */

        private String code;
        private String msg;

        public String getCode() {
            return code;
        }

        public void setCode(String code) {
            this.code = code;
        }

        public String getMsg() {
            return msg;
        }

        public void setMsg(String msg) {
            this.msg = msg;
        }
    }

    public static class DataBean {
        /**
         * uuid : 4CDCC10C4E1246ABB56EEA8BEB2E600F
         * status : 0
         * total : 14
         * total_found : 14
         * pn : 1
         * rn : 15
         * error :
         * matches : [{"cruise_code":"MR20170624-13","cruise_id":"100440","line_id":"100409","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+巴黎13日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/adede8b3b1ca4339abbbdfb06207848e.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在拥有全欧洲最具魅力的黄金海岸，漫步鲜花装点的街头让人恍如在童话中的尼斯；\r\n两大著名时尚之都- 米兰、巴黎尽情享受购物的乐趣。\r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！\r\n搭乘法国时速高达300公里的TGV高速火车，节省您南北拉车的劳顿，并体验欧洲高科技运输工具舒适快感；","trip_date":"2017-06-24","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170722-7N8","cruise_id":"100442","line_id":"100418","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"","feature":"","trip_date":"2017-07-19","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170805-7N8","cruise_id":"100443","line_id":"100419","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/ff03fa1cde004a4a86fc20c6175e1bf8.png","feature":"特别安排： \r\n1.\t精心的酒店安排-当地四星酒店，让您一洗疲劳；\r\n2.\t在迈阿密大沼泽国家公园，体验野生美洲鳄鱼近在咫尺的刺激；\r\n3.\t前往佛罗里达州西锁岛KeyWest-也是美国领土最南端，探寻美国的天涯海角；\r\n4.\t特别安排到北美规模最大的奥特莱斯购物，畅快购物；\r\n5.\t贴心的欢迎仪式\u2014在海洋和悦号游轮上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n6.\t多元文化的餐饮-游轮上每天都会有5顿免费餐饮提供，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有；\r\n7.\t五星级的度假体验-游轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品尝美酒，在游泳池放松；游轮上的娱乐活动精彩纷呈，令人难以置信，随时随地的惊喜，不断满足您的多彩心情。\r\n特别感受： \r\n1.    搭乘世界上最大最新的游轮，22.7万吨的海洋和悦号-精彩难以想象！\r\n2.    数不尽的新鲜-皇家大道、海上剧院、模拟冲浪，位于船尾的极限水滑道可以让您从15层甲板一路滑到6层甲板的百达汇大道上，横跨9层高度，成为游轮界里高度最高的水滑道！就等您来！\r\n3.    前往皇家加勒比私享海岛-海地最美岛屿拉巴第，您将可以尽享私密海域所带来的阳光假期；\r\n4.    前往波多黎各首府圣胡安，穿梭在新旧城区，看带有西班牙殖民时期的遗迹的建筑和摩天大楼的碰撞；\r\n5.    前往荷属圣马丁的菲利普斯堡-最吸引人的是数英里长商业街区中的免税商店和打折免税商店，还可以欣赏城市的艺术画廊，古老的堡垒，赌场和动物园，以及大湾泳滩及其海边步道。\r\n","trip_date":"2017-08-02","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170805-7N8","cruise_id":"100444","line_id":"100419","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d东加勒比海13日阳光之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/ff03fa1cde004a4a86fc20c6175e1bf8.png","feature":"特别安排： \r\n1.\t精心的酒店安排-当地四星酒店，让您一洗疲劳；\r\n2.\t在迈阿密大沼泽国家公园，体验野生美洲鳄鱼近在咫尺的刺激；\r\n3.\t前往佛罗里达州西锁岛KeyWest-也是美国领土最南端，探寻美国的天涯海角；\r\n4.\t特别安排到北美规模最大的奥特莱斯购物，畅快购物；\r\n5.\t贴心的欢迎仪式\u2014在海洋和悦号游轮上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n6.\t多元文化的餐饮-游轮上每天都会有5顿免费餐饮提供，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有；\r\n7.\t五星级的度假体验-游轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品尝美酒，在游泳池放松；游轮上的娱乐活动精彩纷呈，令人难以置信，随时随地的惊喜，不断满足您的多彩心情。\r\n特别感受： \r\n1.    搭乘世界上最大最新的游轮，22.7万吨的海洋和悦号-精彩难以想象！\r\n2.    数不尽的新鲜-皇家大道、海上剧院、模拟冲浪，位于船尾的极限水滑道可以让您从15层甲板一路滑到6层甲板的百达汇大道上，横跨9层高度，成为游轮界里高度最高的水滑道！就等您来！\r\n3.    前往皇家加勒比私享海岛-海地最美岛屿拉巴第，您将可以尽享私密海域所带来的阳光假期；\r\n4.    前往波多黎各首府圣胡安，穿梭在新旧城区，看带有西班牙殖民时期的遗迹的建筑和摩天大楼的碰撞；\r\n5.    前往荷属圣马丁的菲利普斯堡-最吸引人的是数英里长商业街区中的免税商店和打折免税商店，还可以欣赏城市的艺术画廊，古老的堡垒，赌场和动物园，以及大湾泳滩及其海边步道。\r\n","trip_date":"2017-08-05","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170805-13","cruise_id":"100445","line_id":"100409","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+巴黎13日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/adede8b3b1ca4339abbbdfb06207848e.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在拥有全欧洲最具魅力的黄金海岸，漫步鲜花装点的街头让人恍如在童话中的尼斯；\r\n两大著名时尚之都- 米兰、巴黎尽情享受购物的乐趣。\r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！\r\n搭乘法国时速高达300公里的TGV高速火车，节省您南北拉车的劳顿，并体验欧洲高科技运输工具舒适快感；","trip_date":"2017-08-05","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170708-12","cruise_id":"100446","line_id":"100420","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士12日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/49607e9c59984652907cdd2dfac52018.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-07-08","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170722-12","cruise_id":"100448","line_id":"100421","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士 12日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/c5f8fa5436fd4205888177deceedcfab.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-07-22","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MR20170819-12","cruise_id":"100449","line_id":"100422","product_type":"1002","line_name":"MSC地中海邮轮\u201c传奇号\u201d地中海+瑞士12日 之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/39212a87972546c6b767575050e7a98b.jpg","feature":"特别感受： \r\n旗舰级演出\u2014世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！ \r\n耀眼绚丽的设计\u2014传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；\r\n惊险刺激的水上乐园\u2014水上乐园也提供丰富的活动，这里有\u201c香槟碗\u201d高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择\u201c喜马拉雅桥\u201d，在水上60米的高度穿越船体；\r\n海上美食盛宴\u2014传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。\r\n\r\n特别安排：\r\n巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；\r\n漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；\r\n到访\u201c地中海的心脏\u201d瓦莱塔，这里既有古代的遗风又不失现代气息的景色；\r\n在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑； \r\n前往迷人的普罗旺斯首府\u2014马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。\r\n在因特拉肯，前往欧洲阿尔卑斯山脉最美丽的山峰\u2014少女峰观光； \r\n\r\n特别推荐：\r\nMSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来\u201c传奇\u201d的地中海式邮轮体验！","trip_date":"2017-08-19","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1051.0","name":"传奇号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"HM20170930-7N8","cruise_id":"100450","line_id":"100424","product_type":"1002","line_name":"皇家加勒比邮轮海洋和悦号-皇家加勒比游轮\u201c海洋和悦号\u201d西加勒比海13日阳光之旅","image_url":"","feature":"","trip_date":"2017-09-27","all_trip_date":"","travel_days":"13","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1001.0","name":"皇家加勒比邮轮"}],"ship":[{"id":"1030.0","name":"海洋和悦号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MU20170624-11","cruise_id":"100454","line_id":"100426","product_type":"1002","line_name":"MSC地中海邮轮\u201c音乐号\u201d爱琴海11日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/818e57ada74e4e28a8d9a68bc23b02e5.jpg","feature":"特别安排： \r\n精心的酒店安排 \u2014\u2014 全程安排当地四星级酒店，安逸的舒适环境，感受夜的美； \r\n贴心的欢迎仪式 \u2014\u2014 在MSC音乐号上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n多元文化的餐饮 \u2014\u2014 邮轮上每天都会由意大利的大厨安排五顿餐饮，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有。岸上观光行程安排当地特色餐和中餐，让客人体会全世界的美食； \r\n五星级的度假体验\u2014\u2014 邮轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品位美酒，在游泳池放松；船上意大利风格的设计无处不在－美丽与优雅，创新与古典； \r\n\r\n线路特色：\r\n1.乘坐意大利风情豪华邮轮，享受纯正意大利式服务，不必再天天收拾行囊，不出房间就可尽览海上美景，享受美好的休闲假期；\r\n2.前往\u201c浪漫水城\u201d威尼斯，这座迷人的水上城市犹如一位温婉的公主，清波流动，水巷蜿蜒，诗情画意，挥之不去；\r\n3.圣托里尼岛的爱琴海逍遥游，沉醉伊亚小镇浪漫夕阳；\r\n4.安排雅典卫城游览，卫城是雅典以及全希腊的一颗明珠，从这里可以俯瞰整个雅典城，更好的了解这个古城；\r\n5.亚得里亚海沿岸保存中世纪古城原貌最完整的城市之一，并被列入联合国教科文组织世界遗产名录-科托尔；\r\n6.前往莎翁笔下罗密欧与朱丽叶的殉情地\u2014维罗那，这里是年轻人心目中的爱情胜地。","trip_date":"2017-06-24","all_trip_date":"","travel_days":"11","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1019.0","name":"音乐号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"MU20170812-11","cruise_id":"100455","line_id":"100426","product_type":"1002","line_name":"MSC地中海邮轮\u201c音乐号\u201d爱琴海11日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/818e57ada74e4e28a8d9a68bc23b02e5.jpg","feature":"特别安排： \r\n精心的酒店安排 \u2014\u2014 全程安排当地四星级酒店，安逸的舒适环境，感受夜的美； \r\n贴心的欢迎仪式 \u2014\u2014 在MSC音乐号上，将会有鸡尾酒会和船长晚宴，让客人融入西方传统的社交之中，感受不一样的文化体验； \r\n多元文化的餐饮 \u2014\u2014 邮轮上每天都会由意大利的大厨安排五顿餐饮，从法国餐厅到墨西哥餐厅，从日本的寿司到意大利的披萨，应有尽有。岸上观光行程安排当地特色餐和中餐，让客人体会全世界的美食； \r\n五星级的度假体验\u2014\u2014 邮轮上多种多样的娱乐设施与各种体贴的服务：在剧场观看歌舞剧， 在水疗中心做SPA，在酒吧品位美酒，在游泳池放松；船上意大利风格的设计无处不在－美丽与优雅，创新与古典； \r\n\r\n线路特色：\r\n1.乘坐意大利风情豪华邮轮，享受纯正意大利式服务，不必再天天收拾行囊，不出房间就可尽览海上美景，享受美好的休闲假期；\r\n2.前往\u201c浪漫水城\u201d威尼斯，这座迷人的水上城市犹如一位温婉的公主，清波流动，水巷蜿蜒，诗情画意，挥之不去；\r\n3.圣托里尼岛的爱琴海逍遥游，沉醉伊亚小镇浪漫夕阳；\r\n4.安排雅典卫城游览，卫城是雅典以及全希腊的一颗明珠，从这里可以俯瞰整个雅典城，更好的了解这个古城；\r\n5.亚得里亚海沿岸保存中世纪古城原貌最完整的城市之一，并被列入联合国教科文组织世界遗产名录-科托尔；\r\n6.前往莎翁笔下罗密欧与朱丽叶的殉情地\u2014维罗那，这里是年轻人心目中的爱情胜地。","trip_date":"2017-08-12","all_trip_date":"","travel_days":"11","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1009.0","name":"地中海邮轮"}],"ship":[{"id":"1019.0","name":"音乐号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP0623-12","cruise_id":"100456","line_id":"100427","product_type":"1002","line_name":"公主邮轮\u201c帝王公主号\u201d北欧14日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/db6ba67fd77e41adba390b853fcf4671.jpeg","feature":"特别感受：\r\n1.无法抵挡的美食享受\u2014公主邮轮使用最新鲜的食材，世界各国大厨为您带来无与伦比的美味大餐，这里有全球的美食适合任何口味，从无尽的自助选择到美味比萨，都能让您在每一份餐食中体味到新鲜与关怀；\r\n2.休闲天堂\u2014帝王公主号可谓是休闲的天堂。您可以在淡水泳池里自在畅游、在温水按摩池内惬意舒展、在莲花水疗放松身心，或者在专为成人设立的圣殿成人休憩区享受不被打扰的宁静；\r\n3.精彩炫目的娱乐活动\u2014帝王公主号会让您尽情享受眼花缭乱的魔术表演，电影，顶级的喜剧演员和夜总会。每一个角落都有不可思议的事情发生,值得您日夜去探索和体验各种精彩；\r\n4.惊险刺激的海景步道\u2014\u2014吸引眼球的当属位于顶层的海景悬臂酒吧\u2014\u2014海上漫步！一段封闭的玻璃地板走道超出船舷外8米，可以在这里俯瞰脚下40米的海面，感受漫步海上的惊险刺激。\r\n\r\n行程特色：\r\n1.童话之城\u2014丹麦首都哥本哈根，斯堪的纳维亚国家中最大，最具活力的城市，也是旅游和娱乐的天堂，在哥本哈根与小美人鱼雕像轻声交谈；\r\n2.前往\u201c北方的威尼斯\u201d\u2014斯德哥尔摩，这座由14个岛屿组成的城市历史悠久、文化繁荣，令人诧异的美比比皆是，充分感受十四岛之城的独特魅力；\r\n3.在俄罗斯最具欧洲风格的城市\u2014\u2014圣彼得堡是俄罗斯第二大城市，坐落在波罗的海芬兰湾旁，规模仅次于莫斯科，圣彼得堡更具皇家风范，被联合国教科文组织列为第八位受欢迎的旅游城市； \r\n4.诺贝尔和平奖的颁奖地\u2014奥斯陆，奥斯陆是挪威的首都和最大的城市，三面被群山丛林和原野所环抱，因而既有海滨城市的旖旎风光，又有依托高山密林而具有的雄浑气势；\r\n5.在被誉为\u201c波罗的海的钻石\u201d之称的爱沙尼亚首都\u2014\u2014塔林，游览被联合国教科文组织公布为世界文化遗产之一、保留了绝大部份中世纪建筑的老城；\r\n6.\u201c北方洁白城市\u201d\u2014毗邻波罗的海，是一座古典美与现代文明融为一体的都市，又是一座都市建筑与自然风光巧妙结合在一起的花园城。\r\n7.北欧四国各大经典城市无一错过，充分利用14天时间游历各国，饱览各国风情。\r\n\r\n特别推荐：\r\n1.公主邮轮公司打造的\u201c帝王公主号\u201d2014年全新下水，是最新下水的\u201c盛世公主号\u201d和2013年下水的皇家公主号的姐妹船的姊妹船，全新的特色及创新的改革，让想象力更加璀璨；\r\n2.圣彼得堡过夜2日停留，让您充分欣赏这座叹为观止、魅力十足的国际大都市。\r\n","trip_date":"2017-06-23","all_trip_date":"","travel_days":"14","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1034.0","name":"帝王公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP0806-14","cruise_id":"100457","line_id":"100427","product_type":"1002","line_name":"公主邮轮\u201c帝王公主号\u201d北欧14日之旅","image_url":"http://img.caissayl.com/uploadfiles/product/line/db6ba67fd77e41adba390b853fcf4671.jpeg","feature":"特别感受：\r\n1.无法抵挡的美食享受\u2014公主邮轮使用最新鲜的食材，世界各国大厨为您带来无与伦比的美味大餐，这里有全球的美食适合任何口味，从无尽的自助选择到美味比萨，都能让您在每一份餐食中体味到新鲜与关怀；\r\n2.休闲天堂\u2014帝王公主号可谓是休闲的天堂。您可以在淡水泳池里自在畅游、在温水按摩池内惬意舒展、在莲花水疗放松身心，或者在专为成人设立的圣殿成人休憩区享受不被打扰的宁静；\r\n3.精彩炫目的娱乐活动\u2014帝王公主号会让您尽情享受眼花缭乱的魔术表演，电影，顶级的喜剧演员和夜总会。每一个角落都有不可思议的事情发生,值得您日夜去探索和体验各种精彩；\r\n4.惊险刺激的海景步道\u2014\u2014吸引眼球的当属位于顶层的海景悬臂酒吧\u2014\u2014海上漫步！一段封闭的玻璃地板走道超出船舷外8米，可以在这里俯瞰脚下40米的海面，感受漫步海上的惊险刺激。\r\n\r\n行程特色：\r\n1.童话之城\u2014丹麦首都哥本哈根，斯堪的纳维亚国家中最大，最具活力的城市，也是旅游和娱乐的天堂，在哥本哈根与小美人鱼雕像轻声交谈；\r\n2.前往\u201c北方的威尼斯\u201d\u2014斯德哥尔摩，这座由14个岛屿组成的城市历史悠久、文化繁荣，令人诧异的美比比皆是，充分感受十四岛之城的独特魅力；\r\n3.在俄罗斯最具欧洲风格的城市\u2014\u2014圣彼得堡是俄罗斯第二大城市，坐落在波罗的海芬兰湾旁，规模仅次于莫斯科，圣彼得堡更具皇家风范，被联合国教科文组织列为第八位受欢迎的旅游城市； \r\n4.诺贝尔和平奖的颁奖地\u2014奥斯陆，奥斯陆是挪威的首都和最大的城市，三面被群山丛林和原野所环抱，因而既有海滨城市的旖旎风光，又有依托高山密林而具有的雄浑气势；\r\n5.在被誉为\u201c波罗的海的钻石\u201d之称的爱沙尼亚首都\u2014\u2014塔林，游览被联合国教科文组织公布为世界文化遗产之一、保留了绝大部份中世纪建筑的老城；\r\n6.\u201c北方洁白城市\u201d\u2014毗邻波罗的海，是一座古典美与现代文明融为一体的都市，又是一座都市建筑与自然风光巧妙结合在一起的花园城。\r\n7.北欧四国各大经典城市无一错过，充分利用14天时间游历各国，饱览各国风情。\r\n\r\n特别推荐：\r\n1.公主邮轮公司打造的\u201c帝王公主号\u201d2014年全新下水，是最新下水的\u201c盛世公主号\u201d和2013年下水的皇家公主号的姐妹船的姊妹船，全新的特色及创新的改革，让想象力更加璀璨；\r\n2.圣彼得堡过夜2日停留，让您充分欣赏这座叹为观止、魅力十足的国际大都市。\r\n","trip_date":"2017-08-06","all_trip_date":"","travel_days":"14","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1034.0","name":"帝王公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"},{"cruise_code":"RP20170624-7N8","cruise_id":"100458","line_id":"100428","product_type":"1002","line_name":"冰河世纪\u2014公主邮轮\u201c红宝石公主号\u201d 美国阿拉斯加12日之旅","image_url":"","feature":"","trip_date":"2017-06-22","all_trip_date":"","travel_days":"12","lowest_price":"1000000","departure":[{"id":"10033.0","name":"北京"}],"company":[{"id":"1006.0","name":"公主邮轮"}],"ship":[{"id":"1041.0","name":"红宝石公主号"}],"stats_attrs":{"all_trip_date":""},"itinerary_info":"","source_name":"caissa_cruise_yyb"}]
         * statistics_info : {"trip_date":[],"company":[{"num":"3.0","name":"1006","attr":"公主邮轮","ship":[{"num":"1.0","name":"1041","attr":"红宝石公主号"},{"num":"2.0","name":"1034","attr":"帝王公主号"}]},{"num":"4.0","name":"1001","attr":"皇家加勒比邮轮","ship":[{"num":"4.0","name":"1030","attr":"海洋和悦号"}]},{"num":"7.0","name":"1009","attr":"地中海邮轮","ship":[{"num":"5.0","name":"1051","attr":"传奇号"},{"num":"2.0","name":"1019","attr":"音乐号"}]}],"departure":[{"num":"14.0","name":"10033","attr":"北京"}],"travel_days":[{"num":"2.0","name":"11.0","attr":null},{"num":"4.0","name":"12.0","attr":null},{"num":"6.0","name":"13.0","attr":null},{"num":"2.0","name":"14.0","attr":null}],"district_catalog":[{"num":"1.0","name":"1097","attr":"亚洲航线","district_item":[]},{"num":"13.0","name":"1098","attr":"欧美航线","district_item":[{"num":"1.0","name":"1025","attr":"阿拉斯加"},{"num":"5.0","name":"1027","attr":"地中海"},{"num":"4.0","name":"1022","attr":"欧洲"},{"num":"3.0","name":"1028","attr":"加勒比海"}]}],"continent":[{"num":"9.0","name":"10000","attr":"亚洲","country":[{"num":"9.0","name":"10006","attr":"中国"}]},{"num":"41.0","name":"10001","attr":"欧洲","country":[{"num":"2.0","name":"10125","attr":"德国"},{"num":"2.0","name":"10514","attr":"黑山共和国"},{"num":"2.0","name":"10106","attr":"挪威"},{"num":"2.0","name":"10108","attr":"瑞典"},{"num":"3.0","name":"10152","attr":"瑞士"},{"num":"7.0","name":"10133","attr":"意大利"},{"num":"2.0","name":"10128","attr":"爱沙尼亚"},{"num":"2.0","name":"10115","attr":"俄罗斯"},{"num":"5.0","name":"10101","attr":"法国"},{"num":"2.0","name":"10100","attr":"希腊"},{"num":"5.0","name":"10135","attr":"西班牙"},{"num":"2.0","name":"10113","attr":"芬兰"},{"num":"5.0","name":"10129","attr":"马耳他"}]}]}
         * searchanalysis_tips : {"sa_paras":{"range":"","correcting_word":"","keyword":"","correct_word":"","landmark":"","core_word":""}}
         * recommend_type : 0
         * recommends : []
         */

        private String uuid;
        private String status;
        private String total;
        private String total_found;
        private String pn;
        private String rn;
        private String error;
        private StatisticsInfoBean statistics_info;
        private SearchanalysisTipsBean searchanalysis_tips;
        private String recommend_type;
        private List<MatchesBean> matches;
        private List<?> recommends;

        public String getUuid() {
            return uuid;
        }

        public void setUuid(String uuid) {
            this.uuid = uuid;
        }

        public String getStatus() {
            return status;
        }

        public void setStatus(String status) {
            this.status = status;
        }

        public String getTotal() {
            return total;
        }

        public void setTotal(String total) {
            this.total = total;
        }

        public String getTotal_found() {
            return total_found;
        }

        public void setTotal_found(String total_found) {
            this.total_found = total_found;
        }

        public String getPn() {
            return pn;
        }

        public void setPn(String pn) {
            this.pn = pn;
        }

        public String getRn() {
            return rn;
        }

        public void setRn(String rn) {
            this.rn = rn;
        }

        public String getError() {
            return error;
        }

        public void setError(String error) {
            this.error = error;
        }

        public StatisticsInfoBean getStatistics_info() {
            return statistics_info;
        }

        public void setStatistics_info(StatisticsInfoBean statistics_info) {
            this.statistics_info = statistics_info;
        }

        public SearchanalysisTipsBean getSearchanalysis_tips() {
            return searchanalysis_tips;
        }

        public void setSearchanalysis_tips(SearchanalysisTipsBean searchanalysis_tips) {
            this.searchanalysis_tips = searchanalysis_tips;
        }

        public String getRecommend_type() {
            return recommend_type;
        }

        public void setRecommend_type(String recommend_type) {
            this.recommend_type = recommend_type;
        }

        public List<MatchesBean> getMatches() {
            return matches;
        }

        public void setMatches(List<MatchesBean> matches) {
            this.matches = matches;
        }

        public List<?> getRecommends() {
            return recommends;
        }

        public void setRecommends(List<?> recommends) {
            this.recommends = recommends;
        }

        public static class StatisticsInfoBean {
            private List<?> trip_date;
            private List<CompanyBean> company;
            private List<DepartureBean> departure;
            private List<TravelDaysBean> travel_days;
            private List<DistrictCatalogBean> district_catalog;
            private List<ContinentBean> continent;

            public List<?> getTrip_date() {
                return trip_date;
            }

            public void setTrip_date(List<?> trip_date) {
                this.trip_date = trip_date;
            }

            public List<CompanyBean> getCompany() {
                return company;
            }

            public void setCompany(List<CompanyBean> company) {
                this.company = company;
            }

            public List<DepartureBean> getDeparture() {
                return departure;
            }

            public void setDeparture(List<DepartureBean> departure) {
                this.departure = departure;
            }

            public List<TravelDaysBean> getTravel_days() {
                return travel_days;
            }

            public void setTravel_days(List<TravelDaysBean> travel_days) {
                this.travel_days = travel_days;
            }

            public List<DistrictCatalogBean> getDistrict_catalog() {
                return district_catalog;
            }

            public void setDistrict_catalog(List<DistrictCatalogBean> district_catalog) {
                this.district_catalog = district_catalog;
            }

            public List<ContinentBean> getContinent() {
                return continent;
            }

            public void setContinent(List<ContinentBean> continent) {
                this.continent = continent;
            }

            public static class CompanyBean {
                /**
                 * num : 3.0
                 * name : 1006
                 * attr : 公主邮轮
                 * ship : [{"num":"1.0","name":"1041","attr":"红宝石公主号"},{"num":"2.0","name":"1034","attr":"帝王公主号"}]
                 */

                private String num;
                private String name;
                private String attr;
                private List<ShipBean> ship;

                public String getNum() {
                    return num;
                }

                public void setNum(String num) {
                    this.num = num;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public String getAttr() {
                    return attr;
                }

                public void setAttr(String attr) {
                    this.attr = attr;
                }

                public List<ShipBean> getShip() {
                    return ship;
                }

                public void setShip(List<ShipBean> ship) {
                    this.ship = ship;
                }

                public static class ShipBean {
                    /**
                     * num : 1.0
                     * name : 1041
                     * attr : 红宝石公主号
                     */

                    private String num;
                    private String name;
                    private String attr;

                    public String getNum() {
                        return num;
                    }

                    public void setNum(String num) {
                        this.num = num;
                    }

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getAttr() {
                        return attr;
                    }

                    public void setAttr(String attr) {
                        this.attr = attr;
                    }
                }
            }

            public static class DepartureBean {
                /**
                 * num : 14.0
                 * name : 10033
                 * attr : 北京
                 */

                private String num;
                private String name;
                private String attr;

                public String getNum() {
                    return num;
                }

                public void setNum(String num) {
                    this.num = num;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public String getAttr() {
                    return attr;
                }

                public void setAttr(String attr) {
                    this.attr = attr;
                }
            }

            public static class TravelDaysBean {
                /**
                 * num : 2.0
                 * name : 11.0
                 * attr : null
                 */

                private String num;
                private String name;
                private Object attr;

                public String getNum() {
                    return num;
                }

                public void setNum(String num) {
                    this.num = num;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public Object getAttr() {
                    return attr;
                }

                public void setAttr(Object attr) {
                    this.attr = attr;
                }
            }

            public static class DistrictCatalogBean {
                /**
                 * num : 1.0
                 * name : 1097
                 * attr : 亚洲航线
                 * district_item : []
                 */

                private String num;
                private String name;
                private String attr;
                private List<?> district_item;

                public String getNum() {
                    return num;
                }

                public void setNum(String num) {
                    this.num = num;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public String getAttr() {
                    return attr;
                }

                public void setAttr(String attr) {
                    this.attr = attr;
                }

                public List<?> getDistrict_item() {
                    return district_item;
                }

                public void setDistrict_item(List<?> district_item) {
                    this.district_item = district_item;
                }
            }

            public static class ContinentBean {
                /**
                 * num : 9.0
                 * name : 10000
                 * attr : 亚洲
                 * country : [{"num":"9.0","name":"10006","attr":"中国"}]
                 */

                private String num;
                private String name;
                private String attr;
                private List<CountryBean> country;

                public String getNum() {
                    return num;
                }

                public void setNum(String num) {
                    this.num = num;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public String getAttr() {
                    return attr;
                }

                public void setAttr(String attr) {
                    this.attr = attr;
                }

                public List<CountryBean> getCountry() {
                    return country;
                }

                public void setCountry(List<CountryBean> country) {
                    this.country = country;
                }

                public static class CountryBean {
                    /**
                     * num : 9.0
                     * name : 10006
                     * attr : 中国
                     */

                    private String num;
                    private String name;
                    private String attr;

                    public String getNum() {
                        return num;
                    }

                    public void setNum(String num) {
                        this.num = num;
                    }

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getAttr() {
                        return attr;
                    }

                    public void setAttr(String attr) {
                        this.attr = attr;
                    }
                }
            }
        }

        public static class SearchanalysisTipsBean {
            /**
             * sa_paras : {"range":"","correcting_word":"","keyword":"","correct_word":"","landmark":"","core_word":""}
             */

            private SaParasBean sa_paras;

            public SaParasBean getSa_paras() {
                return sa_paras;
            }

            public void setSa_paras(SaParasBean sa_paras) {
                this.sa_paras = sa_paras;
            }

            public static class SaParasBean {
                /**
                 * range :
                 * correcting_word :
                 * keyword :
                 * correct_word :
                 * landmark :
                 * core_word :
                 */

                private String range;
                private String correcting_word;
                private String keyword;
                private String correct_word;
                private String landmark;
                private String core_word;

                public String getRange() {
                    return range;
                }

                public void setRange(String range) {
                    this.range = range;
                }

                public String getCorrecting_word() {
                    return correcting_word;
                }

                public void setCorrecting_word(String correcting_word) {
                    this.correcting_word = correcting_word;
                }

                public String getKeyword() {
                    return keyword;
                }

                public void setKeyword(String keyword) {
                    this.keyword = keyword;
                }

                public String getCorrect_word() {
                    return correct_word;
                }

                public void setCorrect_word(String correct_word) {
                    this.correct_word = correct_word;
                }

                public String getLandmark() {
                    return landmark;
                }

                public void setLandmark(String landmark) {
                    this.landmark = landmark;
                }

                public String getCore_word() {
                    return core_word;
                }

                public void setCore_word(String core_word) {
                    this.core_word = core_word;
                }
            }
        }

        public static class MatchesBean {
            /**
             * cruise_code : MR20170624-13
             * cruise_id : 100440
             * line_id : 100409
             * product_type : 1002
             * line_name : MSC地中海邮轮“传奇号”地中海+巴黎13日之旅
             * image_url : http://img.caissayl.com/uploadfiles/product/line/adede8b3b1ca4339abbbdfb06207848e.jpg
             * feature : 特别感受：
             旗舰级演出—世界著名的太阳马戏团为MSC地中海邮轮乘客专门编排的精彩演出！乘客们可以在欣赏太阳马戏团演出的同时享用美食！ 这样的体验在无论在大海还是陆地上都是独树一帜的！
             耀眼绚丽的设计—传奇号邮轮上运用了先进的技术，打造了一条顶部由80米LED屏幕覆盖，长约96米的室内漫步走道。您可以在此购物、享用美食或小酌一杯。头顶的LED屏幕不断变化，为您带来华丽的视觉享受；
             惊险刺激的水上乐园—水上乐园也提供丰富的活动，这里有“香槟碗”高速漩涡滑梯、儿童游泳池等。富有冒险精神的乘客也可以选择“喜马拉雅桥”，在水上60米的高度穿越船体；
             海上美食盛宴—传奇号邮轮为您提供了丰富的餐饮选择，全天开放20小时的自助餐区域，令您何时都能享受美味。还可在传奇号上品尝出自法国甜点大师Jean Philippe Maury之手的冰淇淋及可丽饼。除了获得过奖项的Kaito寿司餐厅外，全新的Kaito铁板烧餐厅及美式牛排馆也将呈现在您的眼前。

             特别安排：
             巡礼古城庞贝，于古老的城池中逆着时光徐徐行走，公元一世纪古罗马帝国氤氲眼前，一砖一瓦，都让您感受到庞贝昔日的繁华和如今的苍茫；
             漫步陶尔米纳，远眺埃特纳火山，访《西西里岛的美丽传说》、《教父》拍摄地，回望西西里岛永恒经典；
             到访“地中海的心脏”瓦莱塔，这里既有古代的遗风又不失现代气息的景色；
             在加泰罗尼亚的文化中心巴塞罗那欣赏高迪的建筑；
             前往迷人的普罗旺斯首府—马赛，感受浓郁地中海风情和浪漫法国气质的极致融合的气息。
             在拥有全欧洲最具魅力的黄金海岸，漫步鲜花装点的街头让人恍如在童话中的尼斯；
             两大著名时尚之都- 米兰、巴黎尽情享受购物的乐趣。

             特别推荐：
             MSC传奇号作为MSC地中海邮轮旗下新一代旗舰级邮轮，将带来“传奇”的地中海式邮轮体验！
             搭乘法国时速高达300公里的TGV高速火车，节省您南北拉车的劳顿，并体验欧洲高科技运输工具舒适快感；
             * trip_date : 2017-06-24
             * all_trip_date :
             * travel_days : 13
             * lowest_price : 1000000
             * departure : [{"id":"10033.0","name":"北京"}]
             * company : [{"id":"1009.0","name":"地中海邮轮"}]
             * ship : [{"id":"1051.0","name":"传奇号"}]
             * stats_attrs : {"all_trip_date":""}
             * itinerary_info :
             * source_name : caissa_cruise_yyb
             */

            private String cruise_code;
            private String cruise_id;
            private String line_id;
            private String product_type;
            private String line_name;
            private String image_url;
            private String feature;
            private String trip_date;
            private String all_trip_date;
            private String travel_days;
            private String lowest_price;
            private StatsAttrsBean stats_attrs;
            private String itinerary_info;
            private String source_name;
            private List<DepartureBeanX> departure;
            private List<CompanyBeanX> company;
            private List<ShipBeanX> ship;

            public String getCruise_code() {
                return cruise_code;
            }

            public void setCruise_code(String cruise_code) {
                this.cruise_code = cruise_code;
            }

            public String getCruise_id() {
                return cruise_id;
            }

            public void setCruise_id(String cruise_id) {
                this.cruise_id = cruise_id;
            }

            public String getLine_id() {
                return line_id;
            }

            public void setLine_id(String line_id) {
                this.line_id = line_id;
            }

            public String getProduct_type() {
                return product_type;
            }

            public void setProduct_type(String product_type) {
                this.product_type = product_type;
            }

            public String getLine_name() {
                return line_name;
            }

            public void setLine_name(String line_name) {
                this.line_name = line_name;
            }

            public String getImage_url() {
                return image_url;
            }

            public void setImage_url(String image_url) {
                this.image_url = image_url;
            }

            public String getFeature() {
                return feature;
            }

            public void setFeature(String feature) {
                this.feature = feature;
            }

            public String getTrip_date() {
                return trip_date;
            }

            public void setTrip_date(String trip_date) {
                this.trip_date = trip_date;
            }

            public String getAll_trip_date() {
                return all_trip_date;
            }

            public void setAll_trip_date(String all_trip_date) {
                this.all_trip_date = all_trip_date;
            }

            public String getTravel_days() {
                return travel_days;
            }

            public void setTravel_days(String travel_days) {
                this.travel_days = travel_days;
            }

            public String getLowest_price() {
                return lowest_price;
            }

            public void setLowest_price(String lowest_price) {
                this.lowest_price = lowest_price;
            }

            public StatsAttrsBean getStats_attrs() {
                return stats_attrs;
            }

            public void setStats_attrs(StatsAttrsBean stats_attrs) {
                this.stats_attrs = stats_attrs;
            }

            public String getItinerary_info() {
                return itinerary_info;
            }

            public void setItinerary_info(String itinerary_info) {
                this.itinerary_info = itinerary_info;
            }

            public String getSource_name() {
                return source_name;
            }

            public void setSource_name(String source_name) {
                this.source_name = source_name;
            }

            public List<DepartureBeanX> getDeparture() {
                return departure;
            }

            public void setDeparture(List<DepartureBeanX> departure) {
                this.departure = departure;
            }

            public List<CompanyBeanX> getCompany() {
                return company;
            }

            public void setCompany(List<CompanyBeanX> company) {
                this.company = company;
            }

            public List<ShipBeanX> getShip() {
                return ship;
            }

            public void setShip(List<ShipBeanX> ship) {
                this.ship = ship;
            }

            public static class StatsAttrsBean {
                /**
                 * all_trip_date :
                 */

                private String all_trip_date;

                public String getAll_trip_date() {
                    return all_trip_date;
                }

                public void setAll_trip_date(String all_trip_date) {
                    this.all_trip_date = all_trip_date;
                }
            }

            public static class DepartureBeanX {
                /**
                 * id : 10033.0
                 * name : 北京
                 */

                private String id;
                private String name;

                public String getId() {
                    return id;
                }

                public void setId(String id) {
                    this.id = id;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }
            }

            public static class CompanyBeanX {
                /**
                 * id : 1009.0
                 * name : 地中海邮轮
                 */

                private String id;
                private String name;

                public String getId() {
                    return id;
                }

                public void setId(String id) {
                    this.id = id;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }
            }

            public static class ShipBeanX {
                /**
                 * id : 1051.0
                 * name : 传奇号
                 */

                private String id;
                private String name;

                public String getId() {
                    return id;
                }

                public void setId(String id) {
                    this.id = id;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }
            }
        }
    }
}
